xuhaojie/STM8TL5x_StdPeriph_Lib/Libraries/STM8TL5x_StdPeriph_Driver/src/stm8tl5x_flash.c
/**
  ******************************************************************************
  * @file    stm8tl5x_flash.c
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    01-March-2012
  * @brief   This file provides all the Flash firmware functions. These functions
  *          can be executed from Internal FLASH or Internal RAM memories.
  *            - FLASH program and Data EEPROM memories interface configuration
  *            - FLASH program and Data EEPROM memories Programming
  *            - Option Bytes Programming
  *            - Interrupts and flags management
  *            - Functions to be executed from RAM
  *               
  *  @verbatim
  *  
  *          ===================================================================
  *                                 How to use this driver
  *          ===================================================================
  *                           
  *          This driver provides functions to configure and program the Flash 
  *          memory of the stm8tl5x devices
  *          These functions are split in 4 groups
  * 
  *           1. FLASH program and Data EEPROM memories interface configuration 
  *              functions: this group includes the management of the following 
  *              features:
  *                    - Set the fixed programming time
  *                    - Get the fixed programming time  
  *  
  *           2. FLASH program and Data EEPROM memories Programming functions: 
  *              this group includes all needed functions to erase and program 
  *              the FLASH program or the Data EEPROM memory.
  *                    - Lock and Unlock the Flash program interface.
  *                    - Lock and Unlock the Data EEPROM interface.  
  *                    - Erase function: Erase Byte, Erase Word and Erase Block 
  *                      (this last should be executed from internal RAM). 
  *                    - Program functions: Program Byte, Program Word, 
  *                      Program Block (should be executed from internal RAM) 
  *                      and Fast Program Block (should be executed from internal
  *                      RAM).
  *    
  *           3. FLASH Option Bytes Programming functions: this group includes 
  *              all needed functions to:
  *                    - Get the Read Out Protection status (ROP option byte)
  *                    - Get the User Boot Code size (UBC option byte)
  *                    - Get the Protected Code size (PCODE option byte) 
  *                    
  *           4. FLASH Interrupts and flag management functions: this group 
  *              includes all needed functions to:
  *                    - Enable/Disable the flash interrupt sources
  *                    - Get flags status
  *                    - Wait for last flash operation(can be executed from 
  *                      internal RAM)
  *                        
  *           5. Functions to be executed from RAM: this group includes the functions
  *              that should be executed from RAM and provides description on how 
  *              to handle this with the different supported toolchains
  *   
  *  The table below lists the functions that can be executed from RAM.
  *  
  *   +--------------------------------------------------------------------------------|
  *   |   Functions prototypes      |    RAM execution            |     Comments       |
  *   ---------------------------------------------------------------------------------|
  *   |                             | Mandatory in case of block  | Can be executed    |
  *   | FLASH_WaitForLastOperation  | Operation:                  | from Flash in case |
  *   |                             | - Block programming         | of byte and word   |
  *   |                             | - Block erase               | Operations         |
  *   |--------------------------------------------------------------------------------|
  *   | FLASH_ProgramBlock          |       Exclusively           | useless from Flash |
  *   |--------------------------------------------------------------------------------|
  *   | FLASH_EraseBlock            |       Exclusively           | useless from Flash |
  *   |--------------------------------------------------------------------------------|
  *  
  *  To be able to execute functions from RAM several steps have to be followed.
  *  These steps may differ from one toolchain to another.
  *  A detailed description is available below within this driver.
  *  You can also refer to the Flash_DataProgram example provided within the
  *   stm8tl5x_StdPeriph_Lib package.
  * 
  *  @endverbatim   
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm8tl5x_flash.h"

/* Private TypeDef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define FLASH_CLEAR_BYTE ((uint8_t)0x00);
#define FLASH_SET_BYTE   ((uint8_t)0xFF);
#define  OPERATION_TIMEOUT  ((uint16_t)0x1000)
/* Private macro -------------------------------------------------------------*/

/* SDCC patch: simplify sdcc && >64kB indicator over different SPLs */
#if defined(_SDCC_BIGMEM_)
  #define _SDCC_BIGMEM_
  #undef  MemoryAddressCast
  #define MemoryAddressCast uint32_t
#else
  #undef  _SDCC_BIGMEM_
  #undef  MemoryAddressCast
  #define MemoryAddressCast uint16_t
#endif

/* Private variables ---------------------------------------------------------*/

/* SDCC patch: for >64kB to pass data to/from inline ASM (SDCC doesn't support far pointers yet) */
#if defined(_SDCC_BIGMEM_)     
  uint32_t    asm_addr;      // 16b/24b address
  uint8_t     asm_val;       // 1B data for r/w data
#endif // _SDCC_BIGMEM_

/* Private Constants ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

/* SDCC patch: r/w helper routines for >64kB addresses (SDCC doesn't support far pointers yet) */
#if defined (_SDCC_BIGMEM_)
  void      write_byte_address(uint32_t Address, uint8_t Data);   // write single byte to 16b/24b address
  uint8_t   read_byte_address(uint32_t Address);                  // read single byte from 16b/24b address
#endif // _SDCC_BIGMEM_

/* Private functions ---------------------------------------------------------*/
 
/* SDCC patch: r/w helper routines for >64kB addresses using inline ASM (SDCC doesn't support far pointers yet) */
/** @addtogroup FLASH_Helper_functions
  * @{
  */

#if defined (_SDCC_BIGMEM_)
/**
  * @brief  write single byte to address
  * @note   is required for >64kB memory space and SDCC, which doesn't yet support far pointers
  * @param  Address : address to write to
  *         Data :    value to write
  * @retval None
  */
void write_byte_address(uint32_t Address, uint8_t Data)
{
  /* store address & data globally for assember */
  asm_addr = Address;
  asm_val  = Data;

